app/views/clients/index.html.erb

<script>
$(document).ready(function($){

$('#searcher').click(function(){
        var search = $("input#search_entry").val();

	$.ajax({
  	type: 'GET',
  	url: '/clients',
  	data: "search=" + search,
 	success: function(data){
		$('#search_title').html('search results for:&nbsp;' + search);
		$('.clients').html('').load('/clients/arvresult?search=' + search);}
	});
	return false;
  });

$('#phoner').click(function(){
        var phone = $("input#phone_entry").val();

	$.ajax({
  	type: 'GET',
---
SELECT `clients`.* FROM `clients`