app/views/clients/show.html.erb

SELECT `client_medicals`.* FROM `client_medicals` WHERE (client_id = 1) LIMIT 1
---
<%
medical = ClientMedical.find(:first, :conditions => [ "client_id = ?", @client.id ], :limit => 1)

SELECT `appointments`.* FROM `appointments` WHERE (due_date > '2015-09-12' AND client_id = 1) LIMIT 1
---
	 status = 'pending'
	 appointment = Appointment.find(:first, :conditions => [ "status = ? AND client_id = ? ",  status, @client.id])