app/controllers/client_medicals_controller.rb

  def index
    @client_medicals = ClientMedical.all
---
SELECT `client_medicals`.* FROM `client_medicals`

  def show
    @client_medical = ClientMedical.find(params[:id])
---
SELECT `client_medicals`.* FROM `client_medicals` WHERE `client_medicals`.`id` = 1 LIMIT 1

  def create
    @client_medical = ClientMedical.new(params[:client_medical])

    respond_to do |format|
      if @client_medical.save
---
INSERT INTO `client_medicals` (`client_id`, `created_at`, `regimen`, `sulphur_allegy`, `updated_at`) VALUES (1, '2015-09-11 17:54:30', '5A', 'yes', '2015-09-11 17:54:30')