app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT `clients`.* FROM `clients`

  def show
    @client = Client.find(params[:id])
    @appointment = Appointment.new
    @client_medical = ClientMedical.new
    @appointments = Appointment.all
    today = Date.today

    @appointments.each do |appointments|
	if appointments.due_date.to_date < today
		currentApp = Appointment.find(appointments.id)
		currentApp.update_attribute :status, 'done'
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
SELECT `appointments`.* FROM `appointments` WHERE (due_date > '2015-09-12' AND client_id = 1) LIMIT 1
SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 1 LIMIT 1
UPDATE `appointments` SET `status` = 'done', `updated_at` = '2015-09-14 09:44:22' WHERE `appointments`.`id` = 7

  def edit
    @client = Client.find(params[:id])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1