app/controllers/users_controller.rb

  def index
    if logged_in?
    @users = User.find(:all, :order => "first_name")
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1