app/views/appointments/index.html.erb

  <tr>
    <% client = Client.find(appointment.client_id) %>
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 2 LIMIT 1