app/views/appointments/show.html.erb

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
  <b>ARV Number:</b>
  <% client = Client.find(@appointment.client_id) %>